{
  "_name_or_path": "google/vit-base-patch16-224",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "0012",
    "1": "0013",
    "2": "0014",
    "3": "0015",
    "4": "0017",
    "5": "0031",
    "6": "0039",
    "7": "0062",
    "8": "0083",
    "9": "0084",
    "10": "0085",
    "11": "0101",
    "12": "0104",
    "13": "0117",
    "14": "0121",
    "15": "0122",
    "16": "0137",
    "17": "0161",
    "18": "0163",
    "19": "0166",
    "20": "0167",
    "21": "0168",
    "22": "0172",
    "23": "0173",
    "24": "0176",
    "25": "0184",
    "26": "0185",
    "27": "0186",
    "28": "0198",
    "29": "0200",
    "30": "0213",
    "31": "0217",
    "32": "0218",
    "33": "0219",
    "34": "0221",
    "35": "0222",
    "36": "0225",
    "37": "0229",
    "38": "0234",
    "39": "0235",
    "40": "0242",
    "41": "0243",
    "42": "0251",
    "43": "0252",
    "44": "0254",
    "45": "0257",
    "46": "0258",
    "47": "0259",
    "48": "0260",
    "49": "0261",
    "50": "0264",
    "51": "0267",
    "52": "0268"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "0012": 0,
    "0013": 1,
    "0014": 2,
    "0015": 3,
    "0017": 4,
    "0031": 5,
    "0039": 6,
    "0062": 7,
    "0083": 8,
    "0084": 9,
    "0085": 10,
    "0101": 11,
    "0104": 12,
    "0117": 13,
    "0121": 14,
    "0122": 15,
    "0137": 16,
    "0161": 17,
    "0163": 18,
    "0166": 19,
    "0167": 20,
    "0168": 21,
    "0172": 22,
    "0173": 23,
    "0176": 24,
    "0184": 25,
    "0185": 26,
    "0186": 27,
    "0198": 28,
    "0200": 29,
    "0213": 30,
    "0217": 31,
    "0218": 32,
    "0219": 33,
    "0221": 34,
    "0222": 35,
    "0225": 36,
    "0229": 37,
    "0234": 38,
    "0235": 39,
    "0242": 40,
    "0243": 41,
    "0251": 42,
    "0252": 43,
    "0254": 44,
    "0257": 45,
    "0258": 46,
    "0259": 47,
    "0260": 48,
    "0261": 49,
    "0264": 50,
    "0267": 51,
    "0268": 52
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.42.4"
}
